app/views/creatures/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "creatures_tags" ON "tags"."id" = "creatures_tags"."tag_id" WHERE "creatures_tags"."creature_id" = $1  [["creature_id", 4]]
---
  <p><b>Description:</b> <%= @creature.description %></p>
  <% @creature.tags.each do |c| %>