app/controllers/api_controller.rb

  def show
    @creature = Creature.find_by_id params[:id]
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 4]]

  def create
    creature = Creature.create creature_params
---
INSERT INTO "creatures" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2016-05-11 17:57:33.301657"], ["updated_at", "2016-05-11 17:57:33.301657"]]