app/controllers/creatures_controller.rb

INSERT INTO "creatures" ("name", "desciption", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "El Toro"], ["desciption", "A giant blood-eating sombrero."], ["location", "Pike St"], ["created_at", "2016-05-04 23:25:26.854074"], ["updated_at", "2016-05-04 23:25:26.854074"]]
---
  def create
    creature = Creature.create creature_params

SELECT "tags".* FROM "tags"
---
  def new
    @creature = Creature.new
    @tags = Tag.all

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tags".* FROM "tags"
---
  def edit
    @creature = Creature.find params[:id]
    @tags = Tag.all

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @creature = Creature.find params[:id]

SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "creatures" SET "location" = $1, "updated_at" = $2 WHERE "creatures"."id" = $3  [["location", "Seattle!"], ["updated_at", "2016-05-04 23:42:17.251171"], ["id", 1]]
---
  def update
    c = Creature.find params[:id]
    c.update creature_params

DELETE FROM "creatures" WHERE "creatures"."id" = $1  [["id", 1]]
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = $1 LIMIT 1  [["id", 1]]
---
  def destroy
    Creature.find(params[:id]).delete