app/controllers/tags_controller.rb

  def show
    @tags = Tag.find params[:tag_id]
---
SELECT  "tags".* FROM "tags" WHERE "tags"."id" = $1 LIMIT 1  [["id", nil]]